Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27WLSOM1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>L2CC</name>
         <version>11160D</version>
         <description>L2 Cache Controller</description>
         <baseAddress>0x00A00000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF84</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>L2CC</name>
            <description>L2 Cache Controller</description>
            <value>63</value>
         </interrupt>
         <registers>
            <register>
               <name>IDR</name>
               <description>Cache ID Register</description>
               <addressOffset>0x000</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Cache Controller ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TYPR</name>
               <description>Cache Type Register</description>
               <addressOffset>0x004</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IL2ASS</name>
                     <description>Instruction L2 Cache Associativity</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IL2WSIZE</name>
                     <description>Instruction L2 Cache Way Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DL2ASS</name>
                     <description>Data L2 Cache Associativity</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DL2WSIZE</name>
                     <description>Data L2 Cache Way Size</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>L2CEN</name>
                     <description>L2 Cache Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>Auxiliary Control Register</description>
               <addressOffset>0x104</addressOffset>
               <fields>
                  <field>
                     <name>HPSO</name>
                     <description>High Priority for SO and Dev Reads Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBDLE</name>
                     <description>Store Buffer Device Limitation Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCC</name>
                     <description>Exclusive Cache Configuration</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAIE</name>
                     <description>Shared Attribute Invalidate Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASS</name>
                     <description>Associativity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAYSIZE</name>
                     <description>Way Size</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WAYSIZESelect</name>
                        <enumeratedValue>
                           <name>_16KB_WAY</name>
                           <description>16-Kbyte way set associative</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMBEN</name>
                     <description>Event Monitor Bus Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Parity Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAOEN</name>
                     <description>Shared Attribute Override Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWA</name>
                     <description>Force Write Allocate</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CRPOL</name>
                     <description>Cache Replacement Policy</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSLEN</name>
                     <description>Non-Secure Lockdown Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSIAC</name>
                     <description>Non-Secure Interrupt Access Control</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPEN</name>
                     <description>Data Prefetch Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPEN</name>
                     <description>Instruction Prefetch Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRCR</name>
               <description>Tag RAM Control Register</description>
               <addressOffset>0x108</addressOffset>
               <fields>
                  <field>
                     <name>TSETLAT</name>
                     <description>Setup Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TRDLAT</name>
                     <description>Read Access Latency</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TWRLAT</name>
                     <description>Write Access Latency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DRCR</name>
               <description>Data RAM Control Register</description>
               <addressOffset>0x10C</addressOffset>
               <fields>
                  <field>
                     <name>DSETLAT</name>
                     <description>Setup Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DRDLAT</name>
                     <description>Read Access Latency</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DWRLAT</name>
                     <description>Write Access Latency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Event Counter Control Register</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>EVCEN</name>
                     <description>Event Counter Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVC0RST</name>
                     <description>Event Counter 0 Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVC1RST</name>
                     <description>Event Counter 1 Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECFGR1</name>
               <description>Event Counter 1 Configuration Register</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>EIGEN</name>
                     <description>Event Counter Interrupt Generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EIGENSelect</name>
                        <enumeratedValue>
                           <name>INT_DIS</name>
                           <description>Disables (default)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_EN_INCR</name>
                           <description>Enables with Increment condition</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_EN_OVER</name>
                           <description>Enables with Overflow condition</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_GEN_DIS</name>
                           <description>Disables Interrupt generation</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ESRC</name>
                     <description>Event Counter Source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ESRCSelect</name>
                        <enumeratedValue>
                           <name>CNT_DIS</name>
                           <description>Counter Disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_CO</name>
                           <description>Source is CO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DRHIT</name>
                           <description>Source is DRHIT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DRREQ</name>
                           <description>Source is DRREQ</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWHIT</name>
                           <description>Source is DWHIT</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWREQ</name>
                           <description>Source is DWREQ</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWTREQ</name>
                           <description>Source is DWTREQ</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IRHIT</name>
                           <description>Source is IRHIT</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IRREQ</name>
                           <description>Source is IRREQ</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_WA</name>
                           <description>Source is WA</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IPFALLOC</name>
                           <description>Source is IPFALLOC</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFHIT</name>
                           <description>Source is EPFHIT</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFALLOC</name>
                           <description>Source is EPFALLOC</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_SRRCVD</name>
                           <description>Source is SRRCVD</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_SRCONF</name>
                           <description>Source is SRCONF</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFRCVD</name>
                           <description>Source is EPFRCVD</description>
                           <value>0xf</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECFGR0</name>
               <description>Event Counter 0 Configuration Register</description>
               <addressOffset>0x208</addressOffset>
               <fields>
                  <field>
                     <name>EIGEN</name>
                     <description>Event Counter Interrupt Generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EIGENSelect</name>
                        <enumeratedValue>
                           <name>INT_DIS</name>
                           <description>Disables (default)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_EN_INCR</name>
                           <description>Enables with Increment condition</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_EN_OVER</name>
                           <description>Enables with Overflow condition</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_GEN_DIS</name>
                           <description>Disables Interrupt generation</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ESRC</name>
                     <description>Event Counter Source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ESRCSelect</name>
                        <enumeratedValue>
                           <name>CNT_DIS</name>
                           <description>Counter Disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_CO</name>
                           <description>Source is CO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DRHIT</name>
                           <description>Source is DRHIT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DRREQ</name>
                           <description>Source is DRREQ</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWHIT</name>
                           <description>Source is DWHIT</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWREQ</name>
                           <description>Source is DWREQ</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_DWTREQ</name>
                           <description>Source is DWTREQ</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IRHIT</name>
                           <description>Source is IRHIT</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IRREQ</name>
                           <description>Source is IRREQ</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_WA</name>
                           <description>Source is WA</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_IPFALLOC</name>
                           <description>Source is IPFALLOC</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFHIT</name>
                           <description>Source is EPFHIT</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFALLOC</name>
                           <description>Source is EPFALLOC</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_SRRCVD</name>
                           <description>Source is SRRCVD</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_SRCONF</name>
                           <description>Source is SRCONF</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRC_EPFRCVD</name>
                           <description>Source is EPFRCVD</description>
                           <value>0xf</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVR1</name>
               <description>Event Counter 1 Value Register</description>
               <addressOffset>0x20C</addressOffset>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Event Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
