Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27WLSOM1.svd
            <register>
               <name>EISIER_E_MMC_MODE</name>
               <description>Error Interrupt Signal Enable Register</description>
               <alternateRegister>EISIER_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x3A</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CMDTEO</name>
                     <description>Command Timeout Error Signal Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDTEOSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDCRC</name>
                     <description>Command CRC Error Signal Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDCRCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEND</name>
                     <description>Command End Bit Error Signal Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDENDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the CMDEND status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the CMDEND status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDIDX</name>
                     <description>Command Index Error Signal Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDIDXSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATTEO</name>
                     <description>Data Timeout Error Signal Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATTEOSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the DATTEO status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the DATTEO status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATCRC</name>
                     <description>Data CRC Error Signal Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATCRCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the DATCRC status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the DATCRC status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATEND</name>
                     <description>Data End Bit Error Signal Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATENDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the DATEND status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the DATEND status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURLIM</name>
                     <description>Current Limit Error Signal Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CURLIMSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the CURLIM status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the CURLIM status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMD</name>
                     <description>Auto CMD Error Signal Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACMDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the ACMD status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the ACMD status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMA</name>
                     <description>ADMA Error Signal Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ADMASelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the ADMA status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the ADMA status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOTAE</name>
                     <description>Boot Acknowledge Error Signal Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BOOTAESelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACESR</name>
               <description>Auto CMD Error Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACMD12NE</name>
                     <description>Auto CMD12 Not Executed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDTEO</name>
                     <description>Auto CMD Timeout Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDCRC</name>
                     <description>Auto CMD CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDEND</name>
                     <description>Auto CMD End Bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDIDX</name>
                     <description>Auto CMD Index Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDNI</name>
                     <description>Command Not Issued by Auto CMD12 Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC2R_SD_SDIO_MODE</name>
               <description>Host Control 2 Register</description>
               <addressOffset>0x3E</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>UHSMS</name>
                     <description>UHS Mode Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UHSMSSelect</name>
                        <enumeratedValue>
                           <name>SDR12</name>
                           <description>UHS SDR12 Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR25</name>
                           <description>UHS SDR25 Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR50</name>
                           <description>UHS SDR50 Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR104</name>
                           <description>UHS SDR104 Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR50</name>
                           <description>UHS DDR50 Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VS18EN</name>
                     <description>1.8V Signaling Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DRVSELSelect</name>
                        <enumeratedValue>
                           <name>TYPEB</name>
                           <description>Driver Type B is selected (Default)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPEA</name>
                           <description>Driver Type A is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPEC</name>
                           <description>Driver Type C is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPED</name>
                           <description>Driver Type D is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTUN</name>
                     <description>Execute Tuning</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCLKSEL</name>
                     <description>Sampling Clock Select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASINTEN</name>
                     <description>Asynchronous Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVALEN</name>
                     <description>Preset Value Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC2R_E_MMC_MODE</name>
               <description>Host Control 2 Register</description>
               <alternateRegister>HC2R_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x3E</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>HS200EN</name>
                     <description>HS200 Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DRVSELSelect</name>
                        <enumeratedValue>
                           <name>TYPEB</name>
                           <description>Driver Type B is selected (Default)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPEA</name>
                           <description>Driver Type A is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPEC</name>
                           <description>Driver Type C is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TYPED</name>
                           <description>Driver Type D is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTUN</name>
                     <description>Execute Tuning</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCLKSEL</name>
                     <description>Sampling Clock Select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVALEN</name>
                     <description>Preset Value Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
