Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27WLSOM1.svd
               <register>
                  <name>EPTCTLENB_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Control Enable Register (endpoint = 0)</description>
                  <alternateRegister>EPTCTLENB</alternateRegister>
                  <addressOffset>0x4</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>EPT_ENABL</name>
                        <description>Endpoint Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupts Disable DMA</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATAX_RX</name>
                        <description>DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MDATA_RX</name>
                        <description>MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY_TRER</name>
                        <description>TX Packet Ready/Transaction Error Interrupt Enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FL_ISO</name>
                        <description>Error Flow Interrupt Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_CRC_NTR</name>
                        <description>ISO CRC Error/Number of Transaction Error Interrupt Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FLUSH</name>
                        <description>Bank Flush Error Interrupt Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Send/Short Packet Interrupt Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCTLDIS</name>
                  <description>UDPHS Endpoint Control Disable Register (endpoint = 0)</description>
                  <addressOffset>0x8</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>EPT_DISABL</name>
                        <description>Endpoint Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupts Disable DMA</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NYET_DIS</name>
                        <description>NYET Enable (Only for High Speed Bulk OUT endpoints)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Disable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Disable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Disable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY</name>
                        <description>TX Packet Ready Interrupt Disable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RX_SETUP</name>
                        <description>Received SETUP Interrupt Disable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STALL_SNT</name>
                        <description>Stall Sent Interrupt Disable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_IN</name>
                        <description>NAKIN Interrupt Disable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_OUT</name>
                        <description>NAKOUT Interrupt Disable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Disable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Interrupt Disable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCTLDIS_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Control Disable Register (endpoint = 0)</description>
                  <alternateRegister>EPTCTLDIS</alternateRegister>
                  <addressOffset>0x8</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>EPT_DISABL</name>
                        <description>Endpoint Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupts Disable DMA</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATAX_RX</name>
                        <description>DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MDATA_RX</name>
                        <description>MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Disable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Disable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Disable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY_TRER</name>
                        <description>TX Packet Ready/Transaction Error Interrupt Disable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FL_ISO</name>
                        <description>Error Flow Interrupt Disable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_CRC_NTR</name>
                        <description>ISO CRC Error/Number of Transaction Error Interrupt Disable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FLUSH</name>
                        <description>bank flush error Interrupt Disable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Disable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Interrupt Disable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCTL</name>
                  <description>UDPHS Endpoint Control Register (endpoint = 0)</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>EPT_ENABL</name>
                        <description>Endpoint Enable (cleared upon USB reset)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Enabled (Not for CONTROL Endpoints) (cleared upon USB reset)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupt Disables DMA (cleared upon USB reset)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NYET_DIS</name>
                        <description>NYET Disable (Only for High Speed Bulk OUT Endpoints) (cleared upon USB reset)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY</name>
                        <description>TX Packet Ready Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RX_SETUP</name>
                        <description>Received SETUP Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STALL_SNT</name>
                        <description>Stall Sent Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_IN</name>
                        <description>NAKIN Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_OUT</name>
                        <description>NAKOUT Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCTL_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Control Register (endpoint = 0)</description>
                  <alternateRegister>EPTCTL</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>EPT_ENABL</name>
                        <description>Endpoint Enable (cleared upon USB reset)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO_VALID</name>
                        <description>Packet Auto-Valid Enabled (cleared upon USB reset)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTDIS_DMA</name>
                        <description>Interrupt Disables DMA (cleared upon USB reset)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATAX_RX</name>
                        <description>DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MDATA_RX</name>
                        <description>MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY_TRER</name>
                        <description>TX Packet Ready/Transaction Error Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FL_ISO</name>
                        <description>Error Flow Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_CRC_NTR</name>
                        <description>ISO CRC Error/Number of Transaction Error Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FLUSH</name>
                        <description>Bank Flush Error Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK</name>
                        <description>Busy Bank Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet Interrupt Enabled (cleared upon USB reset)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
